The following was deployed to GitLab `dev` (as result of the above patch).

<details> <summary>Terraform</summary>

```txt

Terraform will perform the following actions:

  # aws_instance.gitlab must be replaced
-/+ resource "aws_instance" "gitlab" {
      ~ arn                                  = "arn:aws:ec2:us-east-1:122796619775:instance/i-021ffcc01db4584af" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-1a" -> (known after apply)
      ~ cpu_core_count                       = 2 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-021ffcc01db4584af" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-00bbd0ecb6869b311" -> (known after apply)
      ~ private_dns                          = "ip-172-21-0-99.ec2.internal" -> (known after apply)
      ~ private_ip                           = "172.21.0.99" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      - source_dest_check                    = true -> null
      + spot_instance_request_id             = (known after apply)
      ~ subnet_id                            = "subnet-03776c9deb0ed1c77" -> (known after apply)
        tags                                 = {
            "Name"                = "azul-gitlab"
            "Owner"               = "hannes@ucsc.edu"
            "billing"             = "hca"
            "component"           = "azul-gitlab"
            "deployment"          = "dev"
            "owner"               = "hannes@ucsc.edu"
            "service"             = "azul"
            "terraform_component" = "gitlab"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "9e5742f197c5eff611803732235746d0682ad5bd" -> "95d991316437e0762f69b749ef5b1ee43e3b4f83" # forces replacement
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-0cfcbd85835aecbc3",
        ] -> (known after apply)
        # (7 unchanged attributes hidden)

      ~ capacity_reservation_specification (known after apply)
      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      ~ cpu_options (known after apply)
      - cpu_options {
          - core_count       = 2 -> null
          - threads_per_core = 2 -> null
            # (1 unchanged attribute hidden)
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      ~ ebs_block_device (known after apply)
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdf" -> null
          - encrypted             = true -> null
          - iops                  = 750 -> null
          - kms_key_id            = "arn:aws:kms:us-east-1:122796619775:key/b43df053-3aff-49a7-8060-589985026613" -> null
          - snapshot_id           = "snap-0c8bf7d8472bcf7d5" -> null
          - tags                  = {
              - "Name"  = "azul-gitlab"
              - "owner" = "hannes@ucsc.edu"
            } -> null
          - tags_all              = {
              - "Name"  = "azul-gitlab"
              - "owner" = "hannes@ucsc.edu"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-03b3eb0967f44064f" -> null
          - volume_size           = 250 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options (known after apply)
      - enclave_options {
          - enabled = false -> null
        }

      ~ ephemeral_block_device (known after apply)

      ~ instance_market_options (known after apply)

      ~ maintenance_options (known after apply)
      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      ~ metadata_options {
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
            # (4 unchanged attributes hidden)
        }

      ~ private_dns_name_options (known after apply)
      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      ~ root_block_device {
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          ~ kms_key_id            = "arn:aws:kms:us-east-1:122796619775:key/b43df053-3aff-49a7-8060-589985026613" -> (known after apply)
          - tags                  = {} -> null
          ~ tags_all              = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-016957beb7a60602b" -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group_attachment.gitlab_git must be replaced
-/+ resource "aws_lb_target_group_attachment" "gitlab_git" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-git/f87951c839a4a550-20250502165016765000000003" -> (known after apply)
      ~ target_id        = "i-021ffcc01db4584af" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lb_target_group_attachment.gitlab_http must be replaced
-/+ resource "aws_lb_target_group_attachment" "gitlab_http" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-http/82702e436fcd09e6-20250502165016709600000002" -> (known after apply)
      ~ target_id        = "i-021ffcc01db4584af" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lb_target_group_attachment.gitlab_ssh must be replaced
-/+ resource "aws_lb_target_group_attachment" "gitlab_ssh" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-ssh/b827112b09c72e59-20250502165016807600000004" -> (known after apply)
      ~ target_id        = "i-021ffcc01db4584af" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_volume_attachment.gitlab must be replaced
-/+ resource "aws_volume_attachment" "gitlab" {
      ~ id          = "vai-1597676381" -> (known after apply)
      ~ instance_id = "i-021ffcc01db4584af" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 5 to add, 0 to change, 5 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_volume_attachment.gitlab: Destroying... [id=vai-1597676381]
aws_lb_target_group_attachment.gitlab_http: Destroying... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-http/82702e436fcd09e6-20250502165016709600000002]
aws_lb_target_group_attachment.gitlab_git: Destroying... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-git/f87951c839a4a550-20250502165016765000000003]
aws_lb_target_group_attachment.gitlab_ssh: Destroying... [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-ssh/b827112b09c72e59-20250502165016807600000004]
aws_volume_attachment.gitlab: Provisioning with 'local-exec'...
aws_volume_attachment.gitlab (local-exec): Executing: ["/bin/sh" "-c" "aws ec2 stop-instances --instance-ids i-021ffcc01db4584af && aws ec2 wait instance-stopped --instance-ids i-021ffcc01db4584af"]
aws_lb_target_group_attachment.gitlab_http: Destruction complete after 0s
aws_lb_target_group_attachment.gitlab_git: Destruction complete after 0s
aws_lb_target_group_attachment.gitlab_ssh: Destruction complete after 0s
aws_volume_attachment.gitlab (local-exec): {
aws_volume_attachment.gitlab (local-exec):     "StoppingInstances": [
aws_volume_attachment.gitlab (local-exec):         {
aws_volume_attachment.gitlab (local-exec):             "InstanceId": "i-021ffcc01db4584af",
aws_volume_attachment.gitlab (local-exec):             "CurrentState": {
aws_volume_attachment.gitlab (local-exec):                 "Code": 64,
aws_volume_attachment.gitlab (local-exec):                 "Name": "stopping"
aws_volume_attachment.gitlab (local-exec):             },
aws_volume_attachment.gitlab (local-exec):             "PreviousState": {
aws_volume_attachment.gitlab (local-exec):                 "Code": 16,
aws_volume_attachment.gitlab (local-exec):                 "Name": "running"
aws_volume_attachment.gitlab (local-exec):             }
aws_volume_attachment.gitlab (local-exec):         }
aws_volume_attachment.gitlab (local-exec):     ]
aws_volume_attachment.gitlab (local-exec): }
aws_volume_attachment.gitlab: Still destroying... [id=vai-1597676381, 10s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-1597676381, 20s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-1597676381, 30s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-1597676381, 40s elapsed]
aws_volume_attachment.gitlab: Still destroying... [id=vai-1597676381, 50s elapsed]
aws_volume_attachment.gitlab: Destruction complete after 59s
aws_instance.gitlab: Destroying... [id=i-021ffcc01db4584af]
aws_instance.gitlab: Still destroying... [id=i-021ffcc01db4584af, 10s elapsed]
aws_instance.gitlab: Destruction complete after 11s
aws_instance.gitlab: Creating...
aws_instance.gitlab: Still creating... [10s elapsed]
aws_instance.gitlab: Creation complete after 14s [id=i-05018204451bfe808]
aws_lb_target_group_attachment.gitlab_http: Creating...
aws_lb_target_group_attachment.gitlab_ssh: Creating...
aws_lb_target_group_attachment.gitlab_git: Creating...
aws_volume_attachment.gitlab: Creating...
aws_lb_target_group_attachment.gitlab_http: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-http/82702e436fcd09e6-20250516034507628900000002]
aws_lb_target_group_attachment.gitlab_git: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-git/f87951c839a4a550-20250516034507685800000003]
aws_lb_target_group_attachment.gitlab_ssh: Creation complete after 1s [id=arn:aws:elasticloadbalancing:us-east-1:122796619775:targetgroup/azul-gitlab-ssh/b827112b09c72e59-20250516034507723200000004]
aws_volume_attachment.gitlab: Still creating... [10s elapsed]
aws_volume_attachment.gitlab: Still creating... [20s elapsed]
aws_volume_attachment.gitlab: Creation complete after 21s [id=vai-2319629346]

Apply complete! Resources: 5 added, 0 changed, 5 destroyed.

```

</details>

Which updated the amazon-ssm-agent to the desired (latest) version:
```
[ec2-user@ip-172-21-0-99 ~]$ yum info amazon-ssm-agent
Loaded plugins: extras_suggestions, langpacks, priorities, update-motd
Installed Packages
Name        : amazon-ssm-agent
Arch        : x86_64
Version     : 3.3.2299.0
Release     : 1
Size        : 113 M
Repo        : installed
Summary     : Manage EC2 Instances using SSM APIs
URL         : http://docs.aws.amazon.com/ssm/latest/APIReference/Welcome.html
License     : Apache License, Version 2.0
Description : This package provides Amazon SSM Agent for managing EC2 Instances using SSM APIs

```

Thus far, after scraping `dev.gitlab`, there is no presence of the common AccesDenied events from SSM associated with recreating the instance.